# GetCoordination Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DuctFittingAndAccessoryConnectorData..::..GetCoordination Method
DuctFittingAndAccessoryConnectorData Class See Also
---
Gets the coordination of the connector
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public Transform GetCoordination()
```

Visual Basic
---
```text
Public Function GetCoordination As Transform
```

Visual C++
---
```text
public:
Transform^ GetCoordination()
```

# ### Return Value
The coordination of the connector
# See Also
DuctFittingAndAccessoryConnectorData Class
Autodesk.Revit.DB.Mechanical Namespace